-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1
-- Généré le : sam. 08 avr. 2023 à 18:08
-- Version du serveur : 10.4.25-MariaDB
-- Version de PHP : 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `pfe`
--

-- --------------------------------------------------------

--
-- Structure de la table `cours`
--

CREATE TABLE `cours` (
  `theme` varchar(50) NOT NULL,
  `nbLessons` int(11) DEFAULT NULL,
  `description` varchar(2500) NOT NULL,
  `active` int(11) DEFAULT NULL,
  `duration` double DEFAULT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Déchargement des données de la table `cours`
--

INSERT INTO `cours` (`theme`, `nbLessons`, `description`, `active`, `duration`, `id`) VALUES
('infractions', 0, 'أهم المخالفات في قانون الطرقات التونسي\nالمخالفات (ملخص )\n\nv مخالفة عادية: خطية 20د\n· عدم استعمال أضواء تغيير الاتجاه\n· السير في الاتجاه الممنوع\n· الوقوف والتوقف بالأماكن الممنوعة ما عدا (بالطريق السيارة)\n· الوقوف بكيفية تكون فيها عجلتين على الرصيف وعجلتين على المعبّد.\n· السير بدون عجلة احتياطية\nv مخالفة خطيرة: خطية مالية أقصاها 60د\n· السير ليلا بدون إنارة\n· عدم استعمال الأضواء المناسبة (ضباب، أمطار)\n· عدم احترام الأولوية\n· عدم فسح المجال للعربات المستعملة للمنبهات الصّوتية (الحماية، الإسعاف..)\n· الوقوف والتوقف بجانب الوقوف الاضطراري بالطريق السيارة بدون موجب\n· تجاوز السرعة القصوى المسموح بها بأقل من 20 كلم/س\n· السير برخصة سياقة معلقة الصلوحية\nv الجنـــح:\nØ صنف 1: خطة مالية أقصاها 100د وعقوبة بالسجن مدة شهر واحد أو إحداهما وسحب الرخصة من 1 إلى 6 أشهر.\n· عدم احترام علامة قف\n· عدم احترام الإشارات الضوئية\n· اختراق سكة حديديّة نزول الحواجز أو اشتغال الضوء\n· المجاوزة الممنوعة\n· صنف2: خطية مالية أقصاها 200د وسحب الرخصة من 1 إلى 6 أشهر\n· استعمال عربة تحدث ضجيجا أو ترسل أدخنة كثيفة يتجاوز المقاييس المسموح بها بنسبة تفوق 50%.', 1, 178.2, 1),
('panneaux', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 2),
('priorite', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 3),
('regles', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 4),
('secourisme', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 5),
('croisement', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 6),
('vehicules', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 7),
('arret', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 8),
('mecanique', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 9),
('themeMd', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 10),
('themeA', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 11),
('themeB', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 12),
('themeC', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 13),
('themeCe', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 14),
('themeD', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 15),
('themeD1', 0, 'تأتي لافتات الطرق بأشكال وألوان مختلفة؛ حيث يستخدم اللون الأحمر فقط في علامات التوقف والمنع، وتتميز العلامات التنظيمية دائمًا بخلفية بيضاء، ويستخدم اللون الأصفر لنقل رسائل التحذير، كما تشير اللافتات الخضراء إلى اتجاه حركة المرور المصرح بها أو الحركة بشكل عام، أما اللون الأصفر أو الأخضر الفلوريسنت فهو مخصص لعبور المشاة ومناطق المدارس، كما يرشدك اللون البني إلى مواقع الاستجمام العامة أو الاهتمامات الثقافية، كما تستخدم علامات الطرق برتقالية اللون للدلالة على وجود مناطق عمل على الطرق والتحذير منها، بينما العلامات الزرقاء ترشدك إلى المعلومات السياحية أو طرق الإخلاء،', 0, 0, 16);

-- --------------------------------------------------------

--
-- Structure de la table `lesson`
--

CREATE TABLE `lesson` (
  `id` int(11) NOT NULL,
  `active` int(11) NOT NULL,
  `duration` double DEFAULT NULL,
  `description` varchar(500) DEFAULT NULL,
  `title` varchar(100) DEFAULT NULL,
  `percent` double DEFAULT NULL,
  `filename` varchar(500) DEFAULT NULL,
  `theme` varchar(50) NOT NULL,
  `createdAt` timestamp NOT NULL DEFAULT current_timestamp(),
  `updatedAt` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Index pour les tables déchargées
--

--
-- Index pour la table `cours`
--
ALTER TABLE `cours`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `theme` (`theme`);

--
-- Index pour la table `lesson`
--
ALTER TABLE `lesson`
  ADD PRIMARY KEY (`id`),
  ADD KEY `theme` (`theme`);

--
-- AUTO_INCREMENT pour les tables déchargées
--

--
-- AUTO_INCREMENT pour la table `cours`
--
ALTER TABLE `cours`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT pour la table `lesson`
--
ALTER TABLE `lesson`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- Contraintes pour les tables déchargées
--

--
-- Contraintes pour la table `lesson`
--
ALTER TABLE `lesson`
  ADD CONSTRAINT `lesson_ibfk_1` FOREIGN KEY (`theme`) REFERENCES `cours` (`theme`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
